n = int(input("请输入鸡腿个数："))
m = int(input("请输入鸡蛋个数："))
# 设置宽度,冒号后面的数字为要给槽设置的宽度
# 槽的宽度是包含 参数序号 的值的
# 宽度必须在填充的后面
# a = "今天中午我吃了{:10}个鸡腿，{:20}个鸡蛋".format(n, m)    # {} 大括号就是代表"槽" 默认序号是0~1
# b = "今天中午我吃了{1:10}个鸡腿，{0:20}个鸡蛋".format(n, m)    # 默认按照顺序传，但是也可以使用序号 让他传到指定位置
# print(a)
# print(b)

# 设置填充和对齐
# < 表示左对齐，> 表示右对齐， ^ 表示居中对齐
# * 号位置是你要填充的内容
# a = "今天中午我吃了{:*<10}个鸡腿，{:*>20}个鸡蛋".format(n, m)    # {} 大括号就是代表"槽" 默认序号是0~1
# b = "今天中午我吃了{1:#^10}个鸡腿，{0:#^20}个鸡蛋".format(n, m)
# print(a)
# print(b)

# 设置千位分割符
# 如果设置了千位分隔符，那参数必须是"整数"或是"浮点数"
a = "今天中午我吃了{:*<10,.2}个鸡腿，{:*>20.3}个鸡蛋".format(n, m)    # {} 大括号就是代表"槽" 默认序号是0~1
b = "今天中午我吃了{1:#^10,.2}个鸡腿，{0:#^20.3}个鸡蛋".format(n, m)
print(a)
print(b)
