# 无法判断循环次数的时候使用while循环
# 做固定循环次数的时候使用 for 循环

""" while
判断条件若为True，执行循环体语句，，语句结束后返回再次判断条件，直到条件为False时，循环终止，执行与while同级别的后续语句。

语法规则:
    while 条件:
        当条件为真,执行此代码
"""
# while True:
#     print("123")

""" 限制循环次数
1. 准备纪录循环次数的变量
2. 运行一次后改变循环变量
"""
number = 1
while number <= 10:
    print(number, "abc")  # 运行循环的内容
    # 循环一次以后给number变量加1(改变循环变量)
    number = number + 1

""" 
输出1~100
c = 1
while c <= 100:
    print(c)
    c = c + 1
"""
# # 输出1~100之间,17的倍数
# c = 1
# while c <= 100:
#     # % 表示整除
#     if c % 17 == 0:
#         print(c)
#     c = c + 1

# # 输出1~100之间所有数的和
# c = 1
# s = 0  # 当循环到c的时候，s里面装着 c + 1 以后的结果
# while c <= 100:
#     print(c)
#     s = s + c  # 将每次循环的值进行累加
#     c = c + 1
# print(s)

# # 求1-2+3-4+5...99 = ?
# c = 1
# s = 0
# while c <= 99:
#     if c % 2 == 1:  # 判断c是否是奇数，
#         s = s + c   # c为奇数，则s + c 并且再次赋值给s
#     else:
#         s = s - c   # 判断c不是奇数，则s - c 并且再次赋值给s
#     c = c = 1
# print(s)

# 计算: 1-3+5-7+9...99 = ?
# c = 1
# s = 0
# fu = 1
# while c <= 99:
#     if c % 2 == 1:      # 拿到全部的奇数
#         s = s + c * fu  # 将s + c 的值乘以(fu变量)，下面一行每次会对fu的值进行改变。
#         fu = -fu
#         # 第一次将正的 1 改变为 -1，下一次循环上面的fu的值是 -1 ，到了这里负负得正变为1。
#     c = c + 1
# print(s)

################################for循环#######################################
# 从数据集合中逐一提取元素，放在循环变量中，对于每个提取的元素执行一次语句块。
# for语句的循环执行次数是根据集合中元素个数确定的。
# 数据集合可以是字符串、文件、range()函数或其他组合数据类型等
"""
  语法格式:
        for 变量名 in  数据集合:
            <语句>
"""
# 对于字符串，就是遍历每一个字符
for i in "python":
    print(i)

# 对于列表，就是遍历每一个元素
lt = [1, 3, 6, 9, "刘伟"]
for i in lt:
    print(i)

# 对元组，也是遍历每一个元素
t = (1, 2, 3, 10, 20)
for i in t:
    print(i)
    print(t)  # 打印变量t，打印了5次，因为遍历了5个元素

# 对字典，进行遍历，会拿出字典中的 键  而没有字典中的值
d = {"name": "刘伟", "age": 19}
for i in d:
    print(i)


# for 和 range() 函数使用
for i in range(5):   # range()函数是从0 开始
    print(i)

######################################################################
# for循环的扩展模式
# 当for循环正常执行之后，程序会继续执行else语句中内容，else语句只在循环正常执行之后才执行并结束。

"""
for 变量名 in 集合:
    <语句块1>
else:
    <语句块2>
"""
for i in range(1, 6):
    if i == 3:
        print("第三个有毒")
        break
    print("第{}个鸡腿真香".format(i))

else:
    print("NICE")

# while循环的扩展模式
# 当while循环正常执行之后，程序会继续执行else语句中内容，else语句只在循环正常执行之后才执行并结束。
number = 1
while number <= 10:
    print(number, "abc")  # 运行循环的内容
    # 循环一次以后给number变量加1(改变循环变量)
    number = number + 1
else:
    print("循环正常结束")
