
""" while
语法规则:
    while 条件:
        当条件为真,执行此代码
"""
# while True:
#     print("123")

""" 限制循环次数
1. 准备纪录循环次数的变量
2. 运行一次后改变循环变量
"""
number = 1
while number <= 10:
    print(number, "abc")  # 运行循环的内容
    # 循环一次以后给number变量加1(改变循环变量)
    number = number + 1

""" 
输出1~100
c = 1
while c <= 100:
    print(c)
    c = c + 1
"""
# # 输出1~100之间,17的倍数
# c = 1
# while c <= 100:
#     # % 表示整除
#     if c % 17 == 0:
#         print(c)
#     c = c + 1

# # 输出1~100之间所有数的和
# c = 1
# s = 0  # 当循环到c的时候，s里面装着 c + 1 以后的结果
# while c <= 100:
#     print(c)
#     s = s + c  # 将每次循环的值进行累加
#     c = c + 1
# print(s)

# # 求1-2+3-4+5...99 = ?
# c = 1
# s = 0
# while c <= 99:
#     if c % 2 == 1:  # 判断c是否是奇数，
#         s = s + c   # c为奇数，则s + c 并且再次赋值给s
#     else:
#         s = s - c   # 判断c不是奇数，则s - c 并且再次赋值给s
#     c = c = 1
# print(s)

# 计算: 1-3+5-7+9...99 = ?
# c = 1
# s = 0
# fu = 1
# while c <= 99:
#     if c % 2 == 1:      # 拿到全部的奇数
#         s = s + c * fu  # 将s + c 的值乘以(fu变量)，下面一行每次会对fu的值进行改变。
#         fu = -fu
#         # 第一次将正的 1 改变为 -1，下一次循环上面的fu的值是 -1 ，到了这里负负得正变为1。
#     c = c + 1
# print(s)
